//1
//Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let num = 16;
//
// console.log(num);

//2
//Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 10;
// let b = 2;
// let c = 5;
//
// console.log(a + b + c);

//3
// Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// console.log(100 * 2); //200

//4
//Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// console.log(67 / 7); //9.571428571428571

//5
//Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let a = 10;
// let b = 2;
//
// console.log(a + b); //12
// console.log(a - b); //8
// console.log(a * b); //20
// console.log(a / b); //5

//6
//Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15;
// let d = 2;
// let result = c + d;
//
// console.log(result); //17

//7
//Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30;
// let b = 15;
// let c = a + b;
//
// console.log(c / 4); //11.25

//8
// Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение.
// Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
// let a = 17;
// let b = 10;
// let c = a - b;
// let d = 39;
// let result = c + d;
//
// console.log(result); //46

//9
//Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
// let a = '10';
// let b = '99';
// let result = a + b;
//
// console.log(result); //1099

//10
//Вам даны переменные name='лет', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.
// let name = 'age';
// let number = 10;
// let result = name + number;
//
// console.log(result); //age10

//11
//Преобразуйте в другой тип данных : Вам дано число 123 преобразуйте его в строку.
// let str = '123';
// console.log(str);

//12
//Преобразуйте в другой тип данных : Вам дано булевое значение true преобразуйте его в число используя оператор( не используя функцию Number)
// let v = true;
// v = 13;
// console.log(v);
//
// let i = true;
// console.log(+true);


//13
//Преобразуйте в другой тип данных : Вам даны строки "12s" , "12.2" преобразуйте их в числа двумя методами
// let str = "12s";
// let btn = "12.2";
//
// console.log(Number(btn));
// console.log(+btn);
//
// console.log(Number(str)); //NaN
// console.log(+str); //NaN

//14
//Преобразуйте в другой тип данных : Вам дан null и undefined преобразуйте их в числа.
// let l = null;
// console.log(+null);
//
// let f = undefined;
// console.log(Number(undefined));

//15
//Преобразуйте в другой тип данных :  преобразуйте все возможные булевые значение в числа.
// console.log(Boolean(1));
// console.log(Boolean(0));
// console.log(Boolean(-1));
// console.log(Boolean(0.010));
// console.log(Boolean(''));
// console.log(Boolean('Moon'));
// console.log(Boolean(null));
// console.log(Boolean(undefined));
// console.log(Boolean({}));
//
// console.log(!1);
// console.log(!!2);


//16
//Приведите примеры бинарных операторов.
// console.log(2 + 4);
// console.log(1 - {});

//17
// Приведите пример унарного оператора.
let x = 2;
console.log(+x); //2

let y = -2;
console.log(+y); //-2

console.log(+true); //1
console.log(+''); //0

















